## 访问 Pandas DataFrame 中的元素

In [1]:
import pandas as pd

In [2]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(items, index=['store1', 'store2'])
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [3]:
store_items[['bikes']]

        bikes
store1     20
store2     15

In [4]:
store_items[['bikes', 'pants']]

        bikes  pants
store1     20     30
store2     15      5

In [5]:
store_items.loc[['store1']]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [6]:
# 访问DataFrame的某个元素时，应该先写【列标签】，再写【行标签】
store_items['bikes']['store2']

15

In [7]:
# 添加名为shirts的列
store_items['shirts'] = [15, 2]
store_items

        bikes  glasses  pants  watches  shirts
store1     20      NaN     30       35      15
store2     15     50.0      5       10       2

In [8]:
# 创建新列 suits，为shirts和pants的总和
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

        bikes  glasses  pants  watches  shirts  suits
store1     20      NaN     30       35      15     45
store2     15     50.0      5       10       2      7

In [9]:
# 创建新行 new_store、
# 先为该行新建一个DataFrame: new_store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['store3'])
new_store
# 再用方法 append 将这一行追加给DataFrame: store_items
store_items = store_items.append(new_store)
store_items

        bikes  glasses  pants  shirts  suits  watches
store1     20      NaN     30    15.0   45.0       35
store2     15     50.0      5     2.0    7.0       10
store3     20      4.0     30     NaN    NaN       35

In [10]:
# 给指定行添加指定列信息(给第二行和第三行添加new_watches新列)
store_items['new_watches'] = store_items['watches'][1:]
store_items

        bikes  glasses  pants  shirts  suits  watches  new_watches
store1     20      NaN     30    15.0   45.0       35          NaN
store2     15     50.0      5     2.0    7.0       10         10.0
store3     20      4.0     30     NaN    NaN       35         35.0

In [11]:
# 把新列插入 DataFrame 的任意位置
# 方法 insert 需要指定插入位置
# 在 suits 列之前增加一行名为 shoes 的列
# 第一个参数 loc 就是位置，第二个参数是标签，第三个是数据
store_items.insert(5, 'shoes', [8, 5, 3])
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store1     20      NaN     30    15.0   45.0      8       35          NaN
store2     15     50.0      5     2.0    7.0      5       10         10.0
store3     20      4.0     30     NaN    NaN      3       35         35.0

In [12]:
# 删除行和列
# 方法 pop 可以删除列
store_items.pop('new_watches')
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches
store1     20      NaN     30    15.0   45.0      8       35
store2     15     50.0      5     2.0    7.0      5       10
store3     20      4.0     30     NaN    NaN      3       35

In [13]:
# drop 使用关键字 axis，可以删除列(axis=1) 和 行(axis=0)
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

        bikes  glasses  pants  shirts  suits
store1     20      NaN     30    15.0   45.0
store2     15     50.0      5     2.0    7.0
store3     20      4.0     30     NaN    NaN

In [14]:
store_items = store_items.drop(['store1', 'store2'], axis=0)
store_items

        bikes  glasses  pants  shirts  suits
store3     20      4.0     30     NaN    NaN

In [15]:
# 方法 rename  修改行标签和列标签

# 修改列标签 columns
# 参数是一个字典，字典以原标签为键，以新标签为值
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

        hats  glasses  pants  shirts  suits
store3    20      4.0     30     NaN    NaN

In [16]:
# 修改行标签 index
store_items = store_items.rename(index={'store3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [17]:
# 将行标签设为 DataFrame 的任一列
# pants 列里的值作为行标签
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN